Repository: amit9838/mousam
Catalog: po/*.po
Languages: hi, hu, nl, pl, ru, th

source: Mousam
hi: मौसम

source: Weather at a glance
hi: मौसम एक नज़र में
hu: Tekintse meg az időjárást
pl: Pogoda na rzut oka
ru: Погода в одно мгновение

source: Weather;Mousam;Rain;Cloud;Forecast;GTK4;Python;temperature;
hi: मौसम;मौसम;वर्षा;बादल;पूर्वानुमान;GTK4;पायथन;तापमान;
hu: Időjárás;Mousam;Eső;Felhő;Előrejelzés;GTK4;Python;hőmérséklet;
pl: mc Pogoda;Mousam;Deszcz;Chmura;Prognoza;GTK4;Python;temperatura;
th: สภาพอากาศ;Mousam;ฝน;เมฆ;พยากรณ์;GTK4;Python;อุณหภูมิ;

source: Current Weather conditions and forcasts.
hi: वर्तमान मौसम की स्थिति और पूर्वानुमान।
hu: Aktuális időjárás és előrejelzések.
nl: De huidige weersomstandigheden en -voorspellingen.
pl: Aktualna pogoda oraz prognoza
ru: Текущие условия погоды и прогнозы.
th: สภาพอากาศปัจจุบันและพยากรณ์อากาศ

source: Features:
hi: विशेषताएं:
hu: Jellemzők:
nl: Kenmerken:
pl: Możliwości:
ru: Возможности:
th: คุณสมบัติ:

source: Displays real-time temperature, humidity, wind speed, UV index, pressure and more
hi: वास्तविक-समय में तापमान, आर्द्रता, हवा की गति, UV सूचकांक, वायुदाब और बहुत कुछ प्रदर्शित करता है
hu: Valós idejű hőmérsékletet, páratartalmat, szélsebességet, UV indexet és még többet jelenít meg
nl: Bekijk de huidige temperatuur, kuchvochtigheid, windsnelheid, UV-index, luchtdruk en nog veel meer.
pl: Pokazuje aktualną temperaturę, wilgotność, prędkość wiatru, indeks UV, ciśnienie i inne
ru: Отображает температуру, влажность, скорость ветра, ультрафиолетовый индекс, давление и многое другое в режиме реального времени
th: แสดงอุณหภูมิ ความชื้น ความเร็วลม ดัชนี UV ความกดอากาศ และอื่นๆ แบบเรียลไทม์

source: Utilizes graphical representations, such as temperature , precipitation graphs and wind-speed with direction to provide an hourly forecast for the next 24 hours
hi: अगले 24 घंटों के लिए प्रति घंटा पूर्वानुमान प्रदान करने के लिए दिशा के साथ तापमान, वर्षा लेखाचित्र और हवा की गति जैसे चित्रात्मक प्रतिनिधित्व का उपयोग करता है
hu: Grafikus megjelenítést alkalmaz, mint pl.: hőmérséklet, csapadék grafikonok és szélsebesség széliránnyal, hogy óránkénti előrejelzést adjon a következő 24 órára
nl: Krijg grafische inzicht, bijvoorbeeld met temperatuur- en neerslaggrafieken, windsnelheden met pijlen en een voorspelling voor de komende 24 uur;
pl: Przy użyciu grafik, takich jak wykresy temperatury i opadów oraz siły i kierunku wiatru zapewnia godzinową prognozę na najbliższe 24 godziny
ru: Использует графические представления, такие как графики температуры, осадков и скорости ветра с направлением, чтобы обеспечить почасовый прогноз на следующие 24 часа.
th: ใช้การแสดงกราฟิก เช่น กราฟอุณหภูมิ ปริมาณน้ำฝน และความเร็วลมพร้อมทิศทาง เพื่อให้การพยากรณ์รายชั่วโมงสำหรับ 24 ชั่วโมงข้างหน้า

source: Also provides tomorrow and 7-day forcasts
hi: कल और अगले 7 दिन का पूर्वानुमान भी प्रदान करता है
hu: Biztosít másnapi és 7 napos előrejelzést is
nl: Voorspelling voor morgen en de komende 7 dagen;
pl: Zapewnia również prognozę na jutro i siedem najbliższych dni
ru: Также предоставляет прогнозы на завтра и на 7 дней
th: นอกจากนี้ยังให้การคาดการณ์ล่วงหน้าในวันพรุ่งนี้และ 7 วันล่วงหน้า

source: See conditions in metric or imperial systems
hi: मेट्रिक या इंपीरियल प्रणालियों में स्थितियां देखें
hu: Tekintse meg az időjárási viszonyokat metrikus és angolszász mértékegységekben
nl: Compatibel met zowel het metrisch als imperiaal systeem.
pl: Do wyboru jednostki metryczne lub imperialne
ru: Смотрите условия в метрической или имперской системе
th: ดูสภาพอากาศในระบบเมตริกหรืออิมพีเรียล

source: Overcast day
hi: बादलों से घिरा हुआ दिन

source: Clear Sky - imperial
hi: साफ आसमान - इंपीरियल

source: Thunderstorm
hi: आंधी तूफान
hu: Zivatar
nl: Onweersbui
pl: Burza
ru: Гроза
th: พายุฝนฟ้าคะนอง

source: Dark mode
hi: गहरा रंग

source: Light mode
hi: हल्का रंग

source: Amit Chaudhary
hi: अमित चौधरी
ru: Амит Чаудхари

source: List of cities and their coordinates.
hi: शहरों की सूची और उनके निर्देशांक।
hu: Városok listája és koordinátáik.
nl: Een lijst met locaties en coördinaten.
pl: Lista miejscowości i ich współrzędnych.
ru: Список городов и их координаты.

source: Stores locations added by user in json stringified string format in string
hi: उपयोगकर्ता द्वारा जोड़े गए शहरों को json stringified स्ट्रिंग प्रारूप में सहेजता है
hu: A felhasználó által hozzáadott helyszíneket szöveges json formátumban tárolja szövegként
nl: Bewaart toegevoegde locaties in json-formaat
pl: Lokacje dodane przez użytkownika przechowuje w formacie json
ru: Сохраняет местоположения, добавленные пользователем, в строковом формате json

source: Selected city
hi: चयनित शहर
hu: Kiválasztott város
nl: Gekozen locatie
pl: Wybrana miejscowość
ru: Выбранный город

source: Selected city cords
hi: चयनित शहर के निर्देशांक
hu: Kiválasztott város koordináták
nl: Coördinaten van locatie
pl: Współrzędne wybranej miejscowości
ru: Координаты выбранного города

source: Use Gradient Background
hi: ग्रेडियेंट पृष्ठभूमि का प्रयोग करें
hu: Használjon színátmenetes hátteret
nl: Achtergrondverloop gebruiken
pl: Używaj tła z gradientem
ru: Использовать градиентный фон

source: Apply gradient background on main window corresponding to weather condition
hi: मौसम की स्थिति के अनुरूप मुख्य विंडो पर ग्रेडिएंट पृष्ठभूमि लागू करें
hu: Aktuális időjáráshoz illeszkedő színátmenetet használjon a főképernyőn
nl: Voorzie de achtergrond van een kleurverloop op basis van de huidige weersomstandigheid
pl: Nakłada na główne okno gradient odpowiadający aktualnej pogodzie
ru: Применяет градиентный фон к главному окну в соответствии с погодными условиями

source: Use Inch for precipitation
hi: वर्षण के लिए इंच का प्रयोग करें
hu: Használjon hüvelyket a csapadékmennyiséghez
nl: Inches gebruiken bij neerslaghoeveelheden
pl: Pokazuj opady w calach
ru: Использовать дюймы для осадков

source: Use 24h hour clock
hi: 24 घंटे की घड़ी का प्रयोग करें
hu: Használjon 24 órás formátumot
pl: Używaj 24-godzinnego zegara
ru: Использовать 24 часовой формат

source: Main window width
hi: मुख्य विंडो की चौड़ाई
hu: Főképernyő szélesség
pl: Maksymalna szerokość okna
ru: Ширина главного окна

source: Main window height
hi: मुख्य विंडो की ऊंचाई
hu: Főképernyő magasság
pl: Maksymalna wysokość okna
ru: Высота главного окна

source: Launch the app in maximized mode.
hi: ऐप को फुलस्क्रीन में शुरू करें।
hu: Induljon teljes képernyős módban.
nl: Venster altijd maximaliseren
pl: Uruchamiaj aplikację w trybie zmaksymalizowanym
ru: Запустите приложение в режиме полного экрана

source: Mesaurement sysytem to use - metric,imperial
hi: उपयोग के लिए मापन प्रणाली - मेट्रिक, इंपीरियल

source: metric(km, °C), imperial(mile, °F)
hi: मेट्रिक(किमी, °C), इंपीरियल(मील, °F)
hu: metrikus (km, °C), angolszász (mérföld, °F)
nl: metrisch (km, °C), imperiaal (mijlen, °F)
pl: metryczny (kilometry, °C), imperialny (mile, °F)
ru: метрическая (км, °C), имперская (мили, °F)

source: Clear sky
hi: साफ आसमान
hu: Tiszta égbolt
nl: Heldere lucht
pl: Czyste niebo
ru: Ясное небо
th: ท้องฟ้าแจ่มใส

source: Few Clouds
hi: कुछ बादल
hu: Ritka felhőzet
nl: Weinig bewolking
pl: Lekkie zachmurzenie
ru: Малооблачно
th: มีเมฆน้อย

source: Partly Cloudy
hi: आंशिक बादल छाए रहेंगे
hu: Részben felhős
nl: Gedeeltelijke bewolkt
pl: Częściowe zachmudzenie
ru: Переменная облачность
th: มีเมฆบางส่วน

source: Overcast
hi: बादलों से घिरा हुआ
hu: Borult
nl: Bewolkt
pl: Zachmurzenie
ru: Пасмурно
th: มีเมฆมาก

source: Fog
hi: कोहरा
hu: Köd
nl: Nevel
pl: Mgła
ru: Туман

source: Mist
hi: कुहासा
hu: Köd
pl: Mgła
ru: Дымка

source: Light Drizzle
hi: हल्की बूंदाबांदी
hu: Enyhe szitálás
nl: Lichte motregen
pl: Lekka mżawka
ru: Слабая морось
th: ฝนตกปรอยๆ

source: Moderate Drizzle
hi: मध्यम बूंदाबांदी
hu: Mérsékelt szitálás
nl: Motregen
pl: Umiarkowana mżawka
ru: Умеренная морось
th: ฝนตกปรอยๆ ปานกลาง

source: Heavy Intensity Drizzle
hi: भारी तीव्रता वाली बूंदाबांदी
hu: Erős szitálás
nl: Hevige motregen
pl: Silna mżawka
ru: Сильная морось
th: ฝนตกปรอยๆ หนัก

source: Light Freezing Drizzle
hi: हल्की बर्फीली बूंदाबांदी
hu: Enyhe ónos szitálás
nl: Lichte ijsmotregen
pl: Zamarzająca lekka mżawka
ru: Легкая изморозь

source: Heavy Freezing Drizzle
hi: भारी बर्फीली बूंदाबांदी
hu: Heves ónos szitálás
nl: Hevige ijsmotregen
pl: Zamarzająca silna mżawka
ru: Сильная изморозь

source: Light Rain
hi: हल्की बारिश
hu: Enyhe esőzés
nl: Lichte regenbui
pl: Lekki deszcz
ru: Небольшой дождь
th: ฝนตกเล็กน้อย

source: Moderate Rain
hi: मध्यम बारिश
hu: Mérsékelt esőzés
nl: Regenbui
pl: Deszcz
ru: Умеренный дождь
th: ฝนตกปานกลาง

source: Heavy Rain
hi: भारी बारिश
hu: Heves esőzés
nl: Zware regenbui
pl: Silny deszcz
ru: Ливень
th: ฝนตกหนัก

source: Light Freezing Rain
hi: हल्की बर्फीली बारिश
hu: Enyhe ónos esőzés
nl: IJsregenbui
pl: Zamarzający lekki deszcz
ru: Слабый ледяной дождь

source: Heavy Freezing Rain
hi: भारी बर्फीली बारिश
hu: Heves ónos esözés
nl: Zware ijsregenbui
pl: Zamarzający silny deszcz
ru: Сильный ледяной дождь

source: Light Snow Fall
hi: हल्की बर्फबारी
hu: Enyhe hóesés
nl: Lichte sneeuwval
pl: Lekki śnieg
ru: Слабый снег
th: หิมะตกเล็กน้อย

source: Moderate Snow Fall
hi: मध्यम बर्फबारी
hu: Mérsékelt hóesés
nl: Sneeuwval
pl: Śnieg
ru: Снегопад
th: หิมะตกปานกลาง

source: Heavy Snow Fall
hi: भारी बर्फबारी
hu: Erős hóesés
nl: Zware sneeuwval
pl: Śnieżyca
ru: Сильный снег
th: หิมะตกหนัก

source: Snow grains
hi: बर्फ के दाने
hu: Hódara
nl: Stuifsneeuw
pl: Śnieg ziarnisty
ru: Мелкая снежная крупа

source: Light Rain Showers
hi: हल्की बारिश की बौछारें
hu: Enyhe zápor
nl: Lichte stortregenbui
pl: Lekkie przelotne deszcze
ru: Кратковременный слабый дождь
th: ฝนตกปรอยๆ

source: Moderate Rain Showers
hi: मध्यम वर्षा की बौछारें
hu: Mérsékelt zápor
nl: Stortregenbui
pl: Przelotne deszcze
ru: Периодический умеренный дождь
th: ฝนตกปานกลาง

source: Heavy Rain Showers
hi: भारी बारिश की बौछारें
hu: Heves zápor
nl: Hevige stortregenbui
pl: Silne przelotne deszcze
ru: Продолжительный сильный дождь
th: ฝนตกหนัก

source: Light Snow Showers
hi: हल्की बर्फ की बौछारें
hu: Enyhe hózápor
nl: Lichte sneeuwstorm
pl: Lekki przelotny śnieg
ru: Кратковременный слабый снег
th: หิมะตกปรอยๆ

source: Heavy Snow Showers
hi: भारी बर्फ की बौछारें
hu: Erős hózápor
nl: Hevige sneeuwstorm
pl: Silny przelotny śnieg
ru: Продолжительный сильный снег
th: หิมะตกหนัก

source: Thunderstorm with Hail
hi: ओलावृष्टि के साथ आंधी
hu: Zivatar jégesővel
nl: Onweersbui met hagel
pl: Burza z gradem
ru: Гроза с градом
th: พายุฝนฟ้าคะนองพร้อมลูกเห็บ

source: Air Pollution
hi: वायु प्रदूषण
hu: Légszennyezés
nl: Luchtkwaliteit
pl: Jakość powietrza
ru: Качество воздуха
th: มลพิษทางอากาศ

source: United States AQI standard
hi: अमरीकी AQI मानक
hu: Egyesült Államok levegőminőségi indexe alapján
nl: AQI-standaard (Verenigde Staten)
pl: Standard AQI z USA
ru: Американский стандарт индекса качества воздуха (AQI)
th: มาตรฐาน AQI ของสหรัฐอเมริกา

source: Sunrise & Sunset
hi: सूर्योदय एवं सूर्यास्त
hu: Napkelte és Napnyugta
nl: Zonsopkomst en -ondergang
pl: Wschód i zachód słońca
ru: Восход и закат
th: พระอาทิตย์ขึ้นและพระอาทิตย์ตก

source: Sunrise
hi: सूर्योदय
hu: Napkelte
nl: Zonsopkomst
pl: Wschód
ru: Восход
th: พระอาทิตย์ขึ้น

source: Sunset
hi: सूर्यास्त
hu: Napnyugta
nl: Zonsondergang
pl: Zachód
ru: Закат
th: พระอาทิตย์ตก

source: North
hi: उत्तर
hu: Észak
nl: Noorden
pl: Północy
ru: Север
th: ทิศเหนือ

source: Northeast
hi: उत्तरपूर्व
hu: Északkelet
nl: Noordoosten
pl: Północnego wschodu
ru: Северо-восток
th: ทิศตะวันออกเฉียงเหนือ

source: East
hi: पूर्व
hu: Kelet
nl: Oosten
pl: Wschodu
ru: Восток
th: ทิศตะวันออก

source: Southeast
hi: दक्षिणपूर्व
hu: Délkelet
nl: Zuidoosten
pl: Południowego wschodu
ru: Юго-восток
th: ทิศตะวันออกเฉียงใต้

source: South
hi: दक्षिण
hu: Dél
nl: Zuiden
pl: Południa
ru: Юг
th: ทิศใต้

source: Southwest
hi: दक्षिणपश्चिम
hu: Délnyugat
nl: Zuidwesten
pl: Południowego zachodu
ru: Юго-запад
th: ทิศตะวันตกเฉียงใต้

source: West
hi: पश्चिम
hu: Nyugat
nl: Westen
pl: Zachodu
ru: Запад
th: ทิศตะวันตก

source: Northwest
hi: उत्तरपश्चिम
hu: Északnyugat
nl: Noordwesten
pl: Północnego zachodu
ru: Северо-запад
th: ทิศตะวันตกเฉียงเหนือ

source: Wind
hi: वायु
hu: Szél
nl: Windsnelheid
pl: Wiatr
ru: Ветер
th: ลม

source: Pressure
hi: वायुदाब
hu: Légnyomás
nl: Luchtdruk
pl: Ciśnienie
ru: Давление
th: ความกดอากาศ

source: Humidity
hi: आर्द्रता
hu: Páratartalom
nl: Luchtvochtigheid
pl: Wilgotność
ru: Влажность
th: ความชื่น

source: UV Index
hi: UV सूचकांक
hu: UV erősség
pl: Indeks UV
ru: УФ-индекс
th: ดัชนี UV

source: Feels Like • <b> {0} {1}</b>
hi: <b> {0} {1}</b> • जैसा महसूस होता है

source: Tomorrow
hi: कल
hu: Holnap
nl: Morgen
pl: Jutro
ru: Завтра
th: พรุ่งนี้

source: Weekly
hi: साप्ताहिक
hu: Heti
nl: Gehele week
pl: Tydzień
ru: На неделю
th: รายสัปดาห์

source: Today
hi: आज
hu: Ma
nl: Vandaag
pl: Dzisiaj
ru: Сегодня
th: วันนี้

source: Hourly
hi: प्रति घंटा

source: Precipitation
hi: वर्षण

# wind
source: Day High
hi: दिन का उच्च

# temperature
source: Day Max
hi: दिन का अधिकतम

# precipitation
source: Day High
hi: दिन का उच्च

source: No precipitation today !
hi: आज वर्षा नहीं!
hu: Nincs ma csapadék!
nl: Er is geen neerslag!
pl: Dzisiaj bez opadów!
ru: Сегодня без осадков!
th: วันนี้ไม่มีฝนตก!

source: No precipitation expected today!
hi: आज वर्षा की कोई उम्मीद नहीं!
hu: Nem várható ma csapadék!
nl: Er wordt vandaag geen neerslag verwacht!
pl: Dzisiaj nie spodziewamy się opadów!
ru: Осадки сегодня не ожидаются!
th: วันนี้คาดว่าไม่มีฝน!

source: Anticipate a precipitation-free day !
hi: वर्षा-मुक्त दिन की आशा करें!
hu: Csapadékmentes napra számíthat!
nl: Bereid u voor op een dag zonder neerslag!
pl: Przewidujemy dzień bez opadów!
ru: Ждите сухого дня!
th: คาดว่าจะเป็นวันไม่มีฝนตก!

source: Enjoy a rain-free day today!
hi: आज वर्षा-मुक्त दिन का आनंद लें!
hu: Élvezzen az esőmentes napot ma!
nl: Geniet van een regenloze dag!
pl: Ciesz się dniem bez opadów!
ru: Наслаждайтесь днём без дождя!
th: เพลิดเพลินกับวันที่ไม่มีฝน!

source: Umbrella status: resting. No precipitation in sight !
hi: छाता स्थिति: आराम कर रहा है। वर्षा नहीं दिख रही!
hu: Esernyő állapot: pihenő. Csapadék nem várható!
nl: Paraplustatus: geen regen in de lijn der verwachting!
pl: Status parasola: odpoczynek. Nie będzie padać!
ru: Зонтик можно отложить. Осадки не предвидятся!
th: สถานะร่ม: กำลังพักพักผ่อน ไม่มีฝนให้เห็น!

source: No rain in sight today!
hi: आज बारिश की कोई संभावना नहीं!
hu: Ma nem várható eső!
nl: Geen regen in de lijn der verwachting!
pl: Nie ma deszczu na horyzoncie!
ru: Дождь сегодня не предвидится!
th: วันนี้ไม่เห็นฝนเลย!

source: Now
hi: अभी
hu: Most
nl: Zojuist
pl: Teraz
ru: Сейчас
th: ตอนนี้

source: Horizon
hi: क्षितिज

source: Night
hi: रात्रि
hu: Éjszaka
pl: Noc
ru: Ночь
th: กลางคืน

source: Location
hi: शहर
hu: Helyszín
pl: Miejscowość
th: ตำแหน่งที่ตั้ง

source: Preferences
hi: प्राथमिकताएं
hu: Beállítások
nl: Voorkeuren
pl: Preferencje
ru: Настройки
th: ปรับแต่ง

source: Keyboard Shortcuts
hi: कीबोर्ड शॉर्टकट
hu: Gyorsbillentyűk
pl: Skróty klawiszowe
ru: Клавиатурные сочетания
th: ปุ่มลัดแป้นพิมพ์

source: About Mousam
hi: मौसम के बारे में
hu: A Mousam névjegye
nl: Over Mousam
pl: O programie
ru: О Mousam
th: เกี่ยวกับ Mousam

source: Quit
hi: छोड़ें
hu: Kilépés
pl: Wyjście
ru: Выход
th: ออก

source: Getting Weather Data
hi: मौसम डेटा प्राप्त कर रहे हैं
hu: Időjárás adatok beszerzése
nl: Bezig met ophalen van weergegevens…
pl: Pobieram dane pogodowe
ru: Получение данных о погоде
th: กำลังรับข้อมูลสภาพอากาศ

source: No Internet
hi: इंटरनेट नहीं
hu: Nincs internet
nl: Geen internetverbinding
pl: Brak połączenia z internetem
ru: Нет соединения с Интернетом
th: ไม่มีอินเทอร์เน็ต

source: Could not fetch data from API
hi: API से डेटा प्राप्त नहीं किया जा सका
hu: Nem tudtuk lekérni az adatokat API-ból
nl: De api-gegevens kunnen niet worden opgehaald
pl: Nie udało się pobrać danych z API
ru: Невозможно получить данные через API
th: ไม่สามารถดึงข้อมูลจาก API ได้

source: From
hi: दिशा
hu: Irány
nl: Van
pl: z
ru: Дует с
th: จาก

source: N
hi: उ
hu: É
ru: Север

source: Dewpoint
hi: ओसांक
hu: Harmatpont
nl: Dauwpunt
pl: Punkt rosy
ru: Точка росы
th: จุดน้ำค้าง

# pressure card
source: High
hi: उच्च
hu: Magas
nl: Hoog
pl: Maks.
ru: Максимум
th: สูง

# pressure card
source: Low
hi: निम्न
hu: Alacsony
nl: Laag
pl: Min.
ru: Минимум
th: ต่ำ

# uvindex card
source: High
hi: उच्च
hu: Magas
nl: Hoog
pl: Maks.
ru: Максимум
th: สูง

# uvindex card
source: Low
hi: निम्न
hu: Alacsony
nl: Laag
pl: Min.
ru: Минимум
th: ต่ำ

source: Switched to {}
hi: {} पर बदला गया
hu: Átváltott {}-ra/re
nl: Overgeschakeld naar {}
pl: Przełączono na {}
ru: Переключено на {}
th: เปลี่ยนเป็น {} แล้ว

source: Refreshed Successfully
hi: सफलतापूर्वक रीफ्रेश किया गया
hu: Frissítés sikeres
nl: Herladen voltooid
pl: Odświeżono pomyślnie
ru: Данные успешно обновлены
th: รีเฟรชสำเร็จ

source: Refresh within 5 seconds is ignored!
hi: 5 सेकंड के भीतर रीफ्रेश करने पर नजरअंदाज किया जाएगा!
hu: 5 másodpercen belüli frissítés letiltva!
nl: Herladen binnen 5 seconden wordt genegeerd!
pl: Odświeżenie po mniej niż 5 sekundach jest ignorowane!
ru: Обновление чаще чем в 5 секунд игнорируется!
th: รีเฟรชภายใน 5 วินาทีจะถูกเพิกเฉย!

source: Refreshing...
hi: रीफ्रेश किया जा रहा है...
hu: Frissítés...
nl: Bezig met herladen…
pl: Odświeżanie…
ru: Обновление...
th: กำลังรีเฟรช...

source: Good
hi: अच्छा
hu: Jó
nl: Goed
pl: Dobra
ru: Хорошее качество
th: ดี

source: Moderate
hi: मध्यम
hu: Mérsékelt
nl: Redelijk
pl: Umiarkowana
ru: Умеренное загрязнение
th: ปานกลาง

source: Poor
hi: खराब
hu: Egészségtelen érzékeny csoportok számára
nl: Slecht
pl: Słaba
ru: Плохое качество
th: แย่

source: Unhealthy
hi: अस्वस्थ
hu: Egészségtelen
nl: Ongezond
pl: Niezdrowe
ru: Неблагоприятный уровень
th: ไม่ดีต่อสุขภาพ

source: Severe
hi: गंभीर
hu: Nagyon egészségtelen
nl: Zeer ongezond
pl: Poważna
ru: Сильное загрязнение
th: รุนแรง

source: Hazardous
hi: खतरनाक
hu: Veszélyes
nl: Gevaarlijk
pl: Niebezpieczna
ru: Опасный уровень
th: อันตราย

# uvindex
source: Low
hi: निम्न
hu: Alacsony
nl: Laag
pl: Niski
ru: Низкий
th: ต่ำ

# uvindex
source: Moderate
hi: मध्यम
hu: Mérsékelt
nl: Gemiddeld
pl: Umiarkowany
ru: Умеренный
th: ปานกลาง

# uvindex
source: High
hi: उच्च
hu: Magas
nl: Hoog
pl: Wysoki
ru: Высокий
th: สูง

# uvindex
source: Very High
hi: बहुत उच्च
hu: Nagyon magas
nl: Erg hoog
pl: Bardzo wysoki
ru: Очень высокий
th: สูงมาก

# uvindex
source: Extreme
hi: अत्यधिक
hu: Szélsőségesen magas
nl: Extreem
pl: Ekstremalny
ru: Экстремальный
th: สูงมากๆ

# humidity
source: Low
hi: निम्न
hu: Alacsony
nl: Laag
pl: Niska
ru: Низкая
th: ต่ำ

# humidity
source: Moderate
hi: मध्यम
hu: Mérsékelt
nl: Gemiddeld
pl: Umiarkowana
ru: Умеренная
th: ปานกลาง

# humidity
source: High
hi: उच्च
hu: Magas
nl: Hoog
pl: Wysoka
ru: Высокая
th: สูง

# pressure
source: Low
hi: निम्न
hu: Alacsony
nl: Laag
pl: Niskie
ru: Низкое
th: ต่ำ

# pressure
source: Normal
hi: सामान्य
hu: Átlagos
nl: Normaal
pl: Normalne
ru: Нормальное
th: ปกติ

# pressure
source: High
hi: उच्च
hu: Magas
nl: Hoog
pl: Wysokie
ru: Высокое
th: สูง

source: Calm
hi: शांत
hu: Nyugodt
nl: Kalm
pl: Spokojny
ru: Спокойно

source: Light
hi: हल्की
hu: Gyenge
nl: Licht
pl: Lekki
ru: Легкий
th: เบา

# wind
source: Moderate
hi: मध्यम
hu: Mérsékelt
nl: Gemiddeld
pl: Umiarkowany
ru: Умеренный
th: ปานกลาง

source: Strong
hi: तेज
hu: Erős
nl: Sterk
pl: Silny
ru: Сильный
th: แรง

# wind
source: Extreme
hi: अत्यधिक
hu: Szélsőséges
nl: Extreem
pl: Ekstremalny
ru: Экстремальный
th: รุนแรง

source: km
hi: किमी
ru: км
th: กม.

source: miles
hi: मील
hu: mérföld
nl: mijlen
pl: mile
ru: мили
th: ไมล์

source: Copyright © 2024 Mousam Developers
hi: कॉपीराइट © 2024 मौसम के विकासकर्ता
nl: Copyright © 2024 Mousam-ontwikkelaars
ru: Авторские права © 2024 Mousam Разработчики

source: translator_credits
hi: Scrambled777 <weblate.scrambled777@simplelogin.com>
hu: fordító_elismerések
nl: Heimen Stoffels <vistausss@fastmail.com>
pl: Łukasz Horodecki <lukasz@horodecki.net>, 2024-2026
ru: Сергей Ворон <voron@duck.com> Tom Emv <saibaneko@gmail.com>
th: Atirut Wattanamongkol <atirut.wattanamongkol@gmail.com>

source: Locations
hi: शहर
hu: Helyszínek
nl: Locaties
pl: Miejscowości
ru: Местоположения
th: ตำแหน่งที่ตั้ง

source: Add
hi: जोड़ें
hu: Hozzáadás
nl: Toevoegen
pl: Dodaj
ru: Добавить
th: เพิ่ม

source: Remove location
hi: शहर हटाएं
hu: Helyszín törlése
nl: Locatie verwĳderen
pl: Usuń miejscowość
ru: Удалить местоположение
th: นำตำแหน่งที่ตั้งออก

source: Switch city within 2 seconds is ignored!
hi: 2 सेकंड के भीतर शहर बदलने पर ध्यान नहीं दिया जाएगा!
hu: 2 másodpercen belüli város váltás letiltva!
nl: Overschakelen binnen 2 seconden wordt genegeerd!
pl: Przełączenie miejscowości w odstępie mniejszym niż 2 sekundy jest ignorowane!
ru: Переключение города чаще чем раз в 2 секунды игнорируется!
th: สลับเมืองภายใน 2 วินาทีจะถูกเพิกเฉย!

source: Selected - {}
hi: {} - चयनित
hu: Kiválasztva: {}
nl: Gekozen - {}
pl: wybrano – {}
ru: Выбранный - {}
th: เลือกแล้ว - {}

source: Add New Location
hi: नया शहर जोड़ें
hu: Új helyszín hozzáadása
nl: Locatie toevoegen
pl: Dodaj nową miejscowość
ru: Добавить новое местоположение
th: เพิ่มตำแหน่งที่ตั้งใหม่

source: Search for a city
hi: एक शहर खोजें
hu: Város keresése
nl: Zoeken naar locatie
pl: Wyszukaj miejscowość
ru: Поиск города
th: ค้นหาเมือง

source: Search
hi: खोजें
hu: Keresés
nl: Zoeken
pl: Szukaj
ru: Поиск
th: ค้นหา

source: Added - {0}
hi: {0} - जोड़ा गया
hu: Hozzáadva: {0}
nl: Toegevoegd - {0}
pl: Dodano – {0}
ru: Добавлено - {0}
th: เพิ่มแล้ว - {0}

source: Location already added!
hi: शहर पहले ही जोड़ा जा चुका है!
hu: Helyszín már korábban hozzáadva!
nl: Deze locatie is al toegevoegd!
pl: Miejscowość już jest dodana!
ru: Местоположение уже добавлено!
th: เพิ่มตำแหน่งที่ตั้งนี้ไปแล้ว!

source: Add more locations to delete!
hi: मिटाने के लिए और अधिक शहर जोड़ें!

source: Deleted - {0}
hi: {0} - मिटाया गया
hu: Törölve: {0}
nl: Verwijderd - {0}
pl: Usunięto – {0}
ru: Удалено - {0}
th: ลบแล้ว - {0}

source: Press enter to search
hi: खोजने के लिए Enter दबाएं
hu: Nyomja meg az Enter-t a kereséshez
pl: Naciśnij enter by wyszukać
ru: Нажмите Ввод для поиска
th: กด Enter เพื่อค้นหา

source: No results found!
hi: कोई परिणाम नहीं मिला!
hu: Nincs találat!
pl: Brak wyników!
th: ไม่พบผลลัพธ์!

source: Appearance
hi: दिखावट
hu: Kinézet
nl: Vormgeving
pl: Wygląd
ru: Внешний вид
th: ลักษณะ

source: Dynamic Background
hi: अनुकूलनीय पृष्ठभूमि
hu: Dinamikus háttér
nl: Dynamische achtergrond
pl: Dynamiczne tło
th: พื้นหลังแบบไดนามิก

source: Background changes based on current weather condition (Restart required)
hi: वर्तमान मौसम की स्थिति के आधार पर पृष्ठभूमि परिवर्तन (पुनः प्रारंभ आवश्यक)

source: Time Format
hi: समय प्रारूप
hu: Idő formátum
pl: Format czasu
ru: Формат времени
th: รูปแบบเวลา

source: Weather time format (Refresh required)
hi: मौसम समय प्रारूप (रीफ्रेश आवश्यक)
hu: Időjárás idő formátum (frissítés szükséges)
pl: Format czasu pogody (wymaga odświeżenia)
ru: Формат времени (Требуется обновление)
th: รูปแบบเวลาของสภาพอากาศ (จำเป็นต้องรีเฟรช)

source: 24 Hour
hi: 24 घंटे
hu: 24 órás
pl: 24-godzinny
ru: 24 часовый
th: 24 ชั่วโมง

source: Units &amp; Measurements
hi: इकाइयां &amp; मापन
hu: Mértékegységek
nl: Eenheden en maten
pl: Jednostki miary
ru: Единицы &amp; измерения
th: หน่วยและการวัด

source: METRIC system with units like celsius, km/h, kilometer
hi: सेल्सियस, किमी/घंटा, किलोमीटर जैसी इकाइयों के साथ मेट्रिक प्रणाली

source: IMPERIAL system with units like fahrenheit, mph, miles
hi: फारेनहाइट, मील प्रति घंटे, मील जैसी इकाइयों के साथ इंपीरियल प्रणाली

source: Show precipitation in inch
hi: इंच में वर्षा दिखाएं

source: This option better works during heavy preciptaion (Refresh required)
hi: भारी वर्षा के दौरान यह विकल्प बेहतर काम करता है (रीफ्रेश आवश्यक)

source: Switching within 2 seconds is ignored!
hi: 2 सेकंड के भीतर बदलने पर नज़रअंदाज़ किया जाएगा!

source: Switched to - {}
hi: {} - पर बदला गया
hu: Átváltott {}-ra/re
nl: Overgeschakeld naar {}
pl: Przełączono na – {}
ru: Переключено на - {}

source: General
hi: सामान्य
hu: Általános
pl: Ogólne
ru: Общие
th: ทั่วไป
