Repository: amit9838/mousam
Catalog: po/*.po
Languages: hi, hu, nl, pl, ru, th

source: Refresh Weather
hi: मौसम रीफ्रेश करें
hu: Időjárás frissítése
pl: Odświeża pogodę
ru: Обновить погоду
th: รีเฟรชสภาพอากาศ

source: Navigation
hi: पथ-प्रदर्शन
hu: Navigáció
pl: Nawigacja
ru: Навигация

source: Clear Sky - day
hu: Tiszta Égbolt - nappal
pl: Czyste niebo – dzień
ru: Ясное небо — день
th: ท้องฟ้าแจ่มใส - กลางวัน

source: Snowfall - day
hu: Hőesés - nappal
pl: Opad śniegu – dzień
ru: Снегопад — день

source: Clear Sky - night
hu: Tiszta Égbolt - éjszaka
pl: Czyste niebo – noc
ru: Ясное небо — ночь
th: ท้องฟ้าแจ่มใส - กลางคืน

source: Measurement system to use - metric,imperial
hu: Mértékegységrendszer - metrikus, angolszász
pl: Stosowany system miar – metryczny, imperialny
ru: Используемая система измерения - метрическая, имперская

source: Feels like • <b> {0} {1}</b>
hu: Hőérzet: <b> {0} {1}</b>
pl: Temperatura odczuwalna • <b> {0} {1}</b>
ru: Ощущается как • <b> {0} {1}</b>
th: รู้สึกเหมือน • <b> {0} {1}</b>

# wind
source: Day High •
hu: Napi csúcs
pl: Temperatura maksymalna •
ru: Дневной максимум
th: สูงสุดของวัน •

# temperature
source: Day Max •
hu: Napi maximum
pl: Prędkość maksymalna •
ru: Дневной пик
th: ร้อนสุด •

# precipitation
source: Day High •
hu: Napi maximum
pl: Wysokość maksymalna •
ru: Дневной максимум
th: สูงสุดของวัน •

source: Welcome to Mousam
hu: Üdvözöljük a Mousam-ban
pl: Witamy w Mousam
ru: Добро пожаловать в Mousam
th: ยินดีต้อนรับสู่ Mousam

source: App background changes based on current weather conditions (restart required)
hu: Az alkalmazás háttere megváltozik az aktuális időjárási viszonyoknak megfelelően (újraindítás szükséges)
pl: Tło aplikacji zmienia się w zależności od aktualnej pogody (wymaga restartu)
th: การเปลี่ยนแปลงพื้นหลังแอปขึ้นอยู่กับสภาพอากาศในปัจจุบัน (ต้องเริ่มใหม่)

source: AM / PM
hu: De/Du
pl: 12-godzinny
ru: 12 часовый

source: Metric system with units like Celsius, km/h, and kilometers
hu: Metrikus rendszer, pl.: Celsius, km/h és kilométer
pl: Metryczne jednostki miar takie jak stopnie Celsjusza, km/h, kilometr
ru: Метрическая система: градусы Цельсия (°C), км/ч, километры
th: ระบบเมตริก มีหน่วยเช่น เซลเซียส กม./ชม. และกิโลเมตร

source: Imperial system with units like Fahrenheit, mph, and miles
hu: Angolszász rendszer, pl.: Fahrenheit, mph és mérföld
pl: Imperialne jednostki miar takie jak stopnie Fahrenheita, mph, mila
ru: Имперская система: градусы Фаренгейта (°F), мили/ч, мили
th: หน่วยวัดแบบอังกฤษ มีหน่วยเช่น ฟาเรนไฮต์ ไมล์ต่อชั่วโมง และไมล์

source: Precipitation in inches
hu: Csapadék hüvelykben
pl: Pokazuj opady w calach
ru: Осадки в дюймах
th: หน่วยปริมาณน้ำฝนเป็นนิ้ว

source: This option works better in heavy precipitation (refresh required)
hu: Ez az opció jobban működik erős csapadék esetén (frissítés szükséges)
pl: Sprawdza się lepiej przy większych opadach (wymaga odświeżenia)
ru: Эта опция точнее при сильных осадках (требуется обновление)
th: ตัวเลือกนี้จะทำงานได้ดีขึ้นในกรณีที่มีฝนตกหนัก (ต้องรีเฟรช)

source: Switching locations within 2 seconds is ignored
hu: 2 másodpercen belüli helyszín változtatás letiltva
pl: Przełączanie w odstępie mniejszym niż 2 sekundy jest ignorowane!
ru: Переключение локаций чаще чем раз в 2 секунды игнорируется
th: การสลับตำแหน่งภายใน 2 วินาทีจะถูกเพิกเฉย

source: Snofall - day
th: หิมะตก - กลางวัน
